ATBiccum/WalrusROV-STM32F407-User-Interface-Controller/main.h
#ifndef __MAIN_H

#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

#include "stm32f4xx_ll_dma.h"
#include "stm32f4xx_ll_rcc.h"
#include "stm32f4xx_ll_bus.h"
#include "stm32f4xx_ll_system.h"
#include "stm32f4xx_ll_exti.h"
#include "stm32f4xx_ll_cortex.h"
#include "stm32f4xx_ll_utils.h"
#include "stm32f4xx_ll_pwr.h"
#include "stm32f4xx_ll_usart.h"
#include "stm32f4xx.h"
#include "stm32f4xx_ll_gpio.h"


void checkSumCompare(char data[32]);
int checkSumCalc(char data[32]);
void SystemClock_Config(void);
static void SPI3_Init(void);
static void USART2_UART_Init(void);
static void GPIO_Init(void);
void Error_Handler(void);
void Init_OnBoard_LEDs(void);
static void USART3_UART_Init(void);
static void TIM2_Init(void);
long map(long x, long in_min, long in_max, long out_min, long out_max);
void nRF24();
void arduinoCom();
void nRF_Error_Handler(uint8_t value);
void DMA1_Stream1_IRQHandler(void);
void USART3_IRQHandler(void);
void USART_Process_Data();

#ifndef NVIC_PRIORITYGROUP_0
#define NVIC_PRIORITYGROUP_0         ((uint32_t)0x00000007) /*!< 0 bit  for pre-emption priority,
                                                                 4 bits for subpriority */
#define NVIC_PRIORITYGROUP_1         ((uint32_t)0x00000006) /*!< 1 bit  for pre-emption priority,
                                                                 3 bits for subpriority */
#define NVIC_PRIORITYGROUP_2         ((uint32_t)0x00000005) /*!< 2 bits for pre-emption priority,
                                                                 2 bits for subpriority */
#define NVIC_PRIORITYGROUP_3         ((uint32_t)0x00000004) /*!< 3 bits for pre-emption priority,
                                                                 1 bit  for subpriority */
#define NVIC_PRIORITYGROUP_4         ((uint32_t)0x00000003) /*!< 4 bits for pre-emption priority,
                                                                 0 bit  for subpriority */
#endif

#ifdef __cplusplus

}
#endif

#endif /* __MAIN_H */